import React from "react";
import "./Destination.css";
import DestinationData from "./DestinationData";
const Destination = () => {
  return (
    <div className="destination">
      <h1>الوجهات المفضلة</h1>
      <p>
        انضم الى مجموعة كبيرة من محبي السفر الذين يختارون برامجهم السياحية
        بعناية ..
      </p>
      <DestinationData
        className="first-desc"
        heading=" Tunisie, تونـس"
        text="معروفة بشمسها الدافئة في الشتاء وكثبانها الرملية ومنتجعاتها الصحية الرائعة، غالبًا ما يتم التقليل من شأن أصغر دولة في شمال إفريقيا من حيث جمالها. حيث إنها موطن لبعض الأماكن الخلابة حقًا – من الواحات الجبلية السحرية إلى المنتجعات الشاطئية الرائعة، لذلك صنفناها لك من أمتع الوجهات التي من الممكن لك أن تزورها
"
        img1="../../Images/tunisia1.jpg"
        img2="../../Images/tunisia2.jpg"
      />
      <DestinationData
        className="first-desc-reverse"
        heading=" Tlemcen, تلمسان"
        text="تلمسان هي مدينة عريقة تقع في شمال غرب الجزائر، وهي ذات طبيعة أخّاذة وجمال فريد، ولها تاريخ قديم، وقد ازدهرت كعاصمة لممالك المغرب الأوسط لقرون عديدة، وذلك إبان أكثر من حقبة تاريخية مثل فترة حكم الزيانيين والمرينيين والمرابطين، وتأثرت كثيرا بالحضارة الأندلسية الإسلامية، وما تزال تحتفظ بالكثير من إرثها الثقافي والمعماري الأندلسي"
        img1="../../Images/tlemcen1.jpg"
        img2="../../Images/tlemcen3.jpg"
      />
      <DestinationData
        className="first-desc"
        heading=" Béjaïa, بجـاية"
        text="تعد ولاية بجاية، التي تقع على ساحل البحر الأبيض المتوسط في شمال الجزائر، واحدة من الوجهات السياحية الأكثر شهرة في البلاد. بالإضافة إلى ذلك تتمتع بجاية بتنوع طبيعي فريد يجعلها واحدة من أفضل الأماكن السياحية في ولاية بجاية، حيث تحتوي على شواطئ خلابة، جبال شاهقة، وأماكن تاريخية رائعة
"
        img1="../../Images/bejaia2.jpg"
        img2="../../Images/bejaia.jpg"
      />
    </div>
  );
};

export default Destination;
